SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( EMEF1168
 Type ( Engine )
      WagonShape ( EMEF1168.s )
 FreightAnim ( Sentinel_anime2.s 1 1 )
      Size ( 3.0 3.285 8.5m )
 CentreOfGravity ( 0m 2.0m 0m )
      Mass ( 43t )
 WheelRadius ( 21.45in )
 InertiaTensor ( Box( 3.0 3.285 8.5m ) )
 Coupling (
  Type ( Chain )
  Spring (
   Stiffness ( 1e7N/m 1e7N/m )
   Damping ( 0.2e7N/m/s 0.2e7N/m/s )
   Break ( 1e7N 1e7N )
   r0 ( 10cm 1e9 )
  )
  CouplingHasRigidConnection ()
  Velocity ( 0.1m/s )
 )
 Coupling (
  Type ( Chain )
  Spring (
   Stiffness ( 1e6N/m 2e6N/m )
   Damping ( 1e6N/m/s 1e6N/m/s)
   Break ( 3.1e7N 3.1e7N )
   r0 ( 20cm 30cm )
 
    )
    CouplingHasRigidConnection ( 1 )
    Velocity ( 0.15m/s )
 )
 Buffers (
  Spring (
   Stiffness ( 1e6N/m 5e6N/m )
   Damping ( 1e6N/m/s 1e6N/m/s )
   r0 ( 0m 1e9 )
  )
  Centre ( 0.5 )
  Radius ( 1 )
  Angle ( 0.5deg )
 )
 Adheasion ( 0.22 0.41 1.8 0 )
 DerailRailHeight ( 5cm )
 DerailRailForce ( 2.5*44t )
 DerailBufferForce ( 400kN )
 NumWheels ( 1 )
 Friction (
  118N/m/s  1  1.5mph  0.48  2
  5.1N/rad/s  1  -1rad/s  0  1
 )
 
 BrakeEquipmentType ( "Air_twin_pipe, Distributor" )
 BrakeSystemType ( "Air_twin_pipe" )
 MaxBrakeForce( 45kN )

 MaxHandbrakeForce( 22kN )
 NumberOfHandbrakeLeverSteps( 100 )
 EmergencyBrakeResMaxPressure( 125 )
 TripleValveRatio( 2.5 )
 MaxReleaseRate( 30 )
 MaxApplicationRate( 25 )
 MaxAuxilaryChargingRate( 20 )
 EmergencyResCapacity( 10 )
 EmergencyResChargingRate( 25 )
 BrakeCylinderPressureForMaxBrakeBrakeForce( 70 )
 EmergencyResVolumeMultiplier( 1.15 )
 BrakeAirPressureGainInResForOnePoundFromPipe( 0.25 )

 BrakeDistributorFullServicePressure( 82 )
 BrakeDistributorMaxAuxilaryResPressure( 110 )
 BrakeDistributorEmergencyResPressure( 110 )
 BrakeDistributorReleaseRate( 10 )
 BrakeDistributorApplicationRate( 15 )
 BrakeDistributorTrainPipeControlRatio( 2.03 )
 BrakeDistributorNormalFullReleasePressure( 110 )

 
      IntakePoint ( -4 0.4 FuelDiesel )

 Lights ( 16
  Light (
   comment( Sphere of light forward Bright )
   Type  ( 1 )
   Conditions (
    Headlight ( 3 )
    Unit ( 2 )
    )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ffdfcf9f )
     Position ( 0 2.3 4 )
     Azimuth ( 0 0 0 )
     Transition ( 0 )
     Radius ( 200 )
     Angle ( 10.0 )
     )
    )
   )
  
  Light (
   comment( Sphere of light rear dim )
   Type ( 1 )
   Conditions (
    Headlight ( 2 )
    Unit ( 3 )
    )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ffdfcf9f )
     Position ( 0 4.05 -115 )
     Azimuth ( -180 -180 -180 )
     Transition ( 0 )
     Radius ( 90 )
     Angle ( 10 )
     )
    )
   )
  Light (
   comment( Right Head light forward bright )
   Type  ( 0 )
   Conditions (
    Headlight ( 3 )
    Unit ( 2 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ffffef8f )
     Position ( 0.14 2.3 3.78 )
     Azimuth ( 0 -5 5 )
     Transition ( 0 )
     Radius ( 0.4 )
     )
    )
   )
  Light (
   comment( Left Head light forward bright )
   Type  ( 0 )
   Conditions (
    Headlight ( 3 )
    Unit ( 2 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ffffef8f )
     Position ( -0.14 2.3 3.78 )
     Azimuth ( 0 -5 5 )
     Transition ( 0 )
     Radius ( 0.4 )
     )
    )
   )
  Light (
   comment( Right rear Head light dim )
   Type  ( 0 )
   Conditions (
    Headlight ( 2 )
    Unit ( 2 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( 9fffdf8f )
     Position ( 0.12 2.365 -3.27 )
     Azimuth ( -180 -180 -180 )
     Transition ( 0 )
     Radius ( 0.4 )
     )
    )
   )
  Light (
   comment( Left rear Head light dim )
   Type  ( 0 )
   Conditions (
    Headlight ( 2 )
    Unit ( 2 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( 9fffdf8f )
     Position ( -0.12 2.365 -3.27 )
     Azimuth ( -180 -180 -180 )
     Transition ( 0 )
     Radius ( 0.4 )
     )
    )
   )
  Light (
   comment( Front left red light bright)
   Type  ( 0 )
   Conditions (
    Headlight ( 3 )
    Unit ( 2 )
    )
   FadeIn ( 0 )
   FadeOut ( 0 )
   Cycle ( 0 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ffff0000 )
     Position ( -0.97 1.35 3.64 )
     Azimuth ( 0 0 0 )
     Transition ( 0 )
     Radius ( 0.4 )
     )
    )
   )
  Light (
   comment( Front right green light bright)
   Type  ( 0 )
   Conditions (
    Headlight ( 3 )
    Unit ( 2 )
    )
   FadeIn ( 0 )
   FadeOut ( 0 )
   Cycle ( 0 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ff00ff00 )
     Position ( 0.8 1.35 3.64 )
     Azimuth ( 0 0 0 )
     Transition ( 0 )
     Radius ( 0.4 )
     )
    )
   )
  Light (
   comment( Front left red light dim)
   Type  ( 0 )
   Conditions (
    Headlight ( 2 )
    Unit ( 2 )
    )
   FadeIn ( 0 )
   FadeOut ( 0 )
   Cycle ( 0 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ffff0000 )
     Position ( -0.97 1.35 3.64 )
     Azimuth ( 0 0 0 )
     Transition ( 0 )
     Radius ( 0.4 )
     )
    )
   )
  Light (
   comment( Front right green light dim)
   Type  ( 0 )
   Conditions (
    Headlight ( 2 )
    Unit ( 2 )
    )
   FadeIn ( 0 )
   FadeOut ( 0 )
   Cycle ( 0 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ff00ff00 )
     Position ( 0.8 1.35 3.64 )
     Azimuth ( 0 0 0 )
     Transition ( 0 )
     Radius ( 0.4 )
     )
    )
   )
  Light (
   comment( Rear left red light bright)
   Type  ( 0 )
   Conditions (
    Headlight ( 3 )
    Unit ( 3 )
    )
   FadeIn ( 0 )
   FadeOut ( 0 )
   Cycle ( 0 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ffff0000 )
     Position ( -0.97 1.35 -3.65 )
     Azimuth ( -180 -180 -180 )
     Transition ( 0 )
     Radius ( 0.4 )
     )
    )
   )
  Light (
   comment( Rear left red light dim)
   Type  ( 0 )
   Conditions (
    Headlight ( 2 )
    Unit ( 3 )
    )
   FadeIn ( 0 )
   FadeOut ( 0 )
   Cycle ( 0 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ffff0000 )
     Position ( -0.97 1.35 -3.65 )
     Azimuth ( -180 -180 -180 )
     Transition ( 0 )
     Radius ( 0.4 )
     )
    )
   )
  Light (
   comment( Rear right red light bright)
   Type  ( 0 )
   Conditions (
    Headlight ( 3 )
    Unit ( 3 )
    )
   FadeIn ( 0 )
   FadeOut ( 0 )
   Cycle ( 0 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ffff0000 )
     Position ( 0.97 1.35 -3.65 )
     Azimuth ( -180 -180 -180 )
     Transition ( 0 )
     Radius ( 0.4 )
     )
    )
   )
  Light (
   comment( Rear right red light dim)
   Type  ( 0 )
   Conditions (
    Headlight ( 2 )
    Unit ( 3 )
    )
   FadeIn ( 0 )
   FadeOut ( 0 )
   Cycle ( 0 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ffff0000 )
     Position ( 0.97 1.35 -3.65 )
     Azimuth ( -180 -180 -180 )
     Transition ( 0 )
     Radius ( 0.4 )
     )
    )
   )
  )

 Sound ( "GP38Eng.sms" )
  )

Engine ( EMEF1168
Effects
 (
  DieselSpecialEffects
  (
   comment
   (
    the format of these little blocks is as follow:

    offset.x offset.y offset.z
    normal.x normal.y normal.z
    width in metres

    defining the offset from the shape pivot point
    where steam / smoke should appear, the direction
    it should go and the width of the nozzle
   )

   Exhaust1
   (
                        0.03 3.8 -0.13
                        0 1 0
   0.2
   )
   
  )
        )
      Wagon ( EMEF1168 )
 Type ( Diesel )
 MaxPower ( 184kW )
 MaxForce ( 99.5kN )
 MaxContinuousForce ( 95kN )
 MaxVelocity ( 36mph )

 WheelRadius ( 21.45in )
 Sanding ( 15mph )
      NumWheels ( 6 )
 MaxTemperature ( 160 )
 MaxOilPressure ( 50 )

    AirBrakesAirCompressorPowerRating( 3.5 )
    AirBrakesMainMinResAirPressure( 0 )
    AirBrakesMainMaxAirPressure( 140 )
    AirBrakesMainResVolume( 10 )
    AirBrakesAirCompressorWattage( 19000 )
    AirBrakesCompressorRestartPressure( 130 )
    AirBrakesAirUsedPerPoundsOfBrakePipePressure( 0.5 )
    AirBrakesIsCompressorElectricOrMechanical( 1 )

    TrainBrakesControllerMinPressureReduction( 6 )
 EngineBrakesControllerHasProportionalBrake( 1 )
 EngineBrakesProportionalBrakeLag( 0.9 )
 EngineBrakesControllerMaxApplicationRate( 10 )
    TrainBrakesControllerMaxApplicationRate( 10 )
 EngineBrakesControllerMaxReleaseRate( 10 )
    TrainBrakesControllerMaxReleaseRate( 2 )
 EngineBrakesControllerEmergencyApplicationRate( 15 )
    TrainBrakesControllerEmergencyApplicationRate( 40 )
 EngineBrakesControllerMinSystemPressure( 0 )
    TrainBrakesControllerMinSystemPressure( 0 )
 EngineBrakesControllerMaxSystemPressure( 110 )
    TrainBrakesControllerMaxSystemPressure( 110 )
 EngineBrakesControllerEmergencyBrakeTimePenalty( 0 )
    TrainBrakesControllerEmergencyBrakeTimePenalty( 60 )
 EngineBrakesControllerFullServicePressureDrop( 28 )
    TrainBrakesControllerFullServicePressureDrop( 26 )

    BrakesEngineBrakeType ( "Air_twin_pipe"  )
    BrakesTrainBrakeType ( "Air_twin_pipe" )
    BrakesEngineControllers( "Independent, Train" )

 DoesHornTriggerBell( 0 )

 EngineBrakesControllerDirectControlExponent( 1 )

  CabView ( "Sentinel.cvf" )
 HeadOut ( 1.6 2.5 -0.5 )
 MaxDieselLevel ( 200gal )
 DieselUsedPerHourAtMaxPower ( 25gal )
 DieselUsedPerHourAtIdle ( 2.0gal )
       
 DieselSmokeEffectInitialMagnitude( 0.8 )
 DieselSmokeEffectMaxMagnitude( 1.4 )
 DieselSmokeEffectInitialSmokeRate( 0.2 )
 DieselSmokeEffectMaxSmokeRate( 1.9 )

 DieselEngineIdleRPM( 350 )
 DieselEngineMaxRPM( 1800 )
 DieselEngineSpeedOfMaxTractiveEffort( 7mph )
      DieselEngineMaxRPMChangeRate( 65 )

 DoesHornTriggerBell( 0 )
   
 AWSMonitor(
  MonitoringDeviceMonitorTimeLimit( 0 )
  MonitoringDeviceAlarmTimeLimit( 0 )
  MonitoringDevicePenaltyTimeLimit( 0 )
  MonitoringDeviceCriticalLevel( 0 )
  MonitoringDeviceResetLevel( 0 )
  MonitoringDeviceAppliesFullBrake( 0 )
  MonitoringDeviceAppliesEmergencyBrake( 1 )
  MonitoringDeviceAppliesCutsPower( 0 )
  MonitoringDeviceAppliesShutsDownEngine( 0 )
  )

 EngineVariables( 600 )

        EngineControllers (
            Throttle ( 0 1 0.125 0
                NumNotches ( 9
                    Notch ( 0       0 Dummy )
                    Notch ( 0.125   0 Dummy )
                    Notch ( 0.25    0 Dummy )
                    Notch ( 0.375   0 Dummy )
                    Notch ( 0.5     0 Dummy )
                    Notch ( 0.625   0 Dummy )
                    Notch ( 0.75    0 Dummy )
                    Notch ( 0.875   0 Dummy )
                    Notch ( 1       0 Dummy )
                )
            )
            Brake_Engine ( 0 1 0.0125 0 
                NumNotches ( 1
                    Notch( 0  1 Dummy )
                )
            )
            Brake_Train ( 0 1 0.0125 0.75
                NumNotches ( 5
                    Notch( 0    0 TrainBrakesControllerReleaseStart )
                    Notch( 0.3  1 TrainBrakesControllerGraduatedSelfLapLimitedStart )
                    Notch( 0.85 0 TrainBrakesControllerSuppressionStart )
                    Notch( 0.9  0 TrainBrakesControllerContinuousServiceStart )
                    Notch( 0.95 0 TrainBrakesControllerEmergencyStart )
                )
            )
  
  DirControl ( -1 0 1 1 )
            BellToggle( 0 1 0 )
            AWS ( 0 1 0 )
  Wipers ( 0 1 0 )
            Sanding ( 0 1 0 )
            Horn ( 0 1 0 )
            Vigilance ( 0 1 0 )
            Headlights ( 0 0.25 1 0 )
  EmergencyStopResetToggle( 0 1 0 )
  BailOffButton( 0 1 0 )
            
        )
 Sound ( "GP38Cab.sms" )
 Name ( "EMEF 1168 SENTINEL" )
 Description (
 "Sentinel 1150 diesel switcher; First unit was built in 1966.\n\n"+
 "Model and livery by Carlos Gomes, (c) September 2003\n\n"+ 
 "Engine physics by Bob Boudoin.\n\n"+
 "Chain (screw) coupler version.\n\n"+
        "Paint in CP (Portuguese railways) colours\n\n"+
 "Locomotive type: Diesel with hydraulic transmission\n\n"+
 "Power source: Diesel, Rolls Royce C8 TFL MK IV 8 Cyl\n\n"+
 "Power: 348hp\n\n"+
 "Max. speed: 40 mph\n\n"+
 "Wheel configuration: Six 43in linked by rods\n\n"+
 "Height: 11 ft. (3.365 m)\n\n"+
 "Weight: 41.3 U.S. tons (42 metric tons)\n\n"+
 "Length: 28 ft. (8.517 m)\n\n"+
 "Width: 9.5 ft. (2.9 m)"
     )
 )
EngineOperatingProcedures (
     "To move forward\n"+
 "1. Press the W key to move the Reverser to Forward.\n"+
 "2. Press the ; (SEMICOLON) key to release the train brakes.\n"+
 "3. Press the [ (LEFT BRACKET) key to release the locomotive brake.\n"+
 "4. Press the D key to move the throttle from Idle to Notch 1.\n"+
 "5. Gradually increase power (D key), one notch at a time, until your train reaches the desired speed.\n\n"+
 "To slow the train\n"+
 "1. Press the A key to move the throttle to a lower setting.\n"+
 "2. Use the brakes to further reduce speed if desired.\n\n"+
 "To apply the dynamic brakes\n"+
 "1. Press the A key to move the throttle to the Idle position.\n"+
 "2. Wait for 10 seconds, then press the . (PERIOD) key to advance the Dynamic Brake handle from Off to the Setup position. After allowing a few seconds for braking circuit setup, press the . (PERIOD) key again to set the desired level of dynamic braking (Levels 1 - 8).\n\n"+
 "To release the dynamic brakes\n"+
 "1. Press the D key to move the throttle towards Idle.\n\n"+
 "To apply the train brakes\n"+
 "1. Press the ' (APOSTROPHE) key to apply the train brakes.\n\n"+
 "To bail off the train brakes on the locomotive\n"+
 "1. Press the / (FORWARD SLASH) key.\n\n"+
 "To release the train brakes\n"+
 "1. Press the ; (SEMICOLON) key to release the train brakes.\n\n"+
 "To apply the locomotive brake\n"+
 "1. Press the ] (RIGHT BRACKET) key to apply the locomotive brake.\n\n"+
 "To release the locomotive brake\n"+
 "1. Press the [ (LEFT BRACKET) key to release the locomotive brake.\n\n"+
 "To activate emergency braking\n"+
 "1. Press the A key to reduce the throttle to Idle.\n"+
 "2. Press the BACKSPACE key to activate emergency braking.\n\n"+
 "To back up\n"+
 "1. Bring your train to a full stop.\n"+
 "2. Press the S key to move the Reverser to the Reverse position.\n"+
 "3. Release the brakes.\n"+
 "4. Slowly advance the throttle lever (D key).\n\n"+
 "To couple to a car or locomotive\n"+
 "1. Coast into the unit at a very slow speed, about 2 mph.\n"+
 "TIP: To use the Coupling view, press the 6 key.\n"+
 "2. Press F9 to open the Train Operations window.\n"+
 "3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
 "4. Close the Train Operations window.\n\n"+
 "To uncouple from a car or locomotive\n"+
 "1. Press F9 to open the Train Operations window.\n"+
 "2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
 "3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
 "4. Close the Train Operations window."
     ) 
)
